test/conConsoleLog/artillery_slow.txt
Phase started: unnamed (index: 0, duration: 1s) 21:58:59(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 21:59:00(-0300)

--------------------------------------
Metrics for period to: 21:59:00(-0300) (width: 0.623s)
--------------------------------------

http.codes.200: ................................................................ 32
http.request_rate: ............................................................. 33/sec
http.requests: ................................................................. 33
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 22
  median: ...................................................................... 3
  p95: ......................................................................... 6
  p99: ......................................................................... 16
http.responses: ................................................................ 32
vusers.created: ................................................................ 32
vusers.created_by_name.0: ...................................................... 32


--------------------------------------
Metrics for period to: 21:59:10(-0300) (width: 9.698s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 1
http.codes.200: ................................................................ 19
http.request_rate: ............................................................. 6/sec
http.requests: ................................................................. 52
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 6804
  median: ...................................................................... 3
  p95: ......................................................................... 5
  p99: ......................................................................... 5
http.responses: ................................................................ 19
vusers.created: ................................................................ 18
vusers.created_by_name.0: ...................................................... 18
vusers.failed: ................................................................. 1


--------------------------------------
Metrics for period to: 21:59:20(-0300) (width: 9.869s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 37
http.codes.200: ................................................................ 43
http.request_rate: ............................................................. 8/sec
http.requests: ................................................................. 24
http.response_time:
  min: ......................................................................... 1318
  max: ......................................................................... 9178
  median: ...................................................................... 6569.8
  p95: ......................................................................... 9230.4
  p99: ......................................................................... 9230.4
http.responses: ................................................................ 43
vusers.failed: ................................................................. 37


--------------------------------------
Metrics for period to: 21:59:30(-0300) (width: 9.3s)
--------------------------------------

http.codes.200: ................................................................ 204
http.request_rate: ............................................................. 23/sec
http.requests: ................................................................. 192
http.response_time:
  min: ......................................................................... 246
  max: ......................................................................... 283
  median: ...................................................................... 262.5
  p95: ......................................................................... 278.7
  p99: ......................................................................... 284.3
http.responses: ................................................................ 204
vusers.completed: .............................................................. 12
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 28880
  max: ......................................................................... 29641.1
  median: ...................................................................... 28862.3
  p95: ......................................................................... 29445.4
  p99: ......................................................................... 29445.4


All VUs finished. Total time: 31 seconds

--------------------------------
Summary report @ 21:59:30(-0300)
--------------------------------

errors.ETIMEDOUT: .............................................................. 38
http.codes.200: ................................................................ 298
http.request_rate: ............................................................. 9/sec
http.requests: ................................................................. 301
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 9178
  median: ...................................................................... 262.5
  p95: ......................................................................... 6838
  p99: ......................................................................... 9230.4
http.responses: ................................................................ 298
vusers.completed: .............................................................. 12
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 38
vusers.session_length:
  min: ......................................................................... 28880
  max: ......................................................................... 29641.1
  median: ...................................................................... 28862.3
  p95: ......................................................................... 29445.4
  p99: ......................................................................... 29445.4